7767517
224 255
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=1728
Swish                    silu_81                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_82                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_4                   1 1 6 7 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_83                  1 1 7 8
Split                    splitncnn_1              1 2 8 9 10
Convolution              conv_5                   1 1 10 11 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Swish                    silu_84                  1 1 11 12
Convolution              conv_6                   1 1 12 13 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_85                  1 1 13 14
BinaryOp                 add_0                    2 1 9 14 15 0=0
Convolution              conv_7                   1 1 5 16 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_86                  1 1 16 17
Concat                   cat_0                    2 1 15 17 18 0=0
Convolution              conv_8                   1 1 18 19 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_87                  1 1 19 20
Convolution              conv_9                   1 1 20 21 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_88                  1 1 21 22
Split                    splitncnn_2              1 2 22 23 24
Convolution              conv_10                  1 1 24 25 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_89                  1 1 25 26
Split                    splitncnn_3              1 2 26 27 28
Convolution              conv_11                  1 1 28 29 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_90                  1 1 29 30
Convolution              conv_12                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_91                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_4              1 2 33 34 35
Convolution              conv_13                  1 1 35 36 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_92                  1 1 36 37
Convolution              conv_14                  1 1 37 38 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_93                  1 1 38 39
BinaryOp                 add_2                    2 1 34 39 40 0=0
Convolution              conv_15                  1 1 23 41 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_94                  1 1 41 42
Concat                   cat_1                    2 1 40 42 43 0=0
Convolution              conv_16                  1 1 43 44 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_95                  1 1 44 45
Split                    splitncnn_5              1 2 45 46 47
Convolution              conv_17                  1 1 47 48 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_96                  1 1 48 49
Split                    splitncnn_6              1 2 49 50 51
Convolution              conv_18                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_97                  1 1 52 53
Split                    splitncnn_7              1 2 53 54 55
Convolution              conv_19                  1 1 55 56 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_98                  1 1 56 57
Convolution              conv_20                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_99                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Split                    splitncnn_8              1 2 60 61 62
Convolution              conv_21                  1 1 62 63 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_100                 1 1 63 64
Convolution              conv_22                  1 1 64 65 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_101                 1 1 65 66
BinaryOp                 add_4                    2 1 61 66 67 0=0
Split                    splitncnn_9              1 2 67 68 69
Convolution              conv_23                  1 1 69 70 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_102                 1 1 70 71
Convolution              conv_24                  1 1 71 72 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_103                 1 1 72 73
BinaryOp                 add_5                    2 1 68 73 74 0=0
Convolution              conv_25                  1 1 50 75 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_104                 1 1 75 76
Concat                   cat_2                    2 1 74 76 77 0=0
Convolution              conv_26                  1 1 77 78 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_105                 1 1 78 79
Split                    splitncnn_10             1 2 79 80 81
Convolution              conv_27                  1 1 81 82 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_106                 1 1 82 83
Split                    splitncnn_11             1 2 83 84 85
Convolution              conv_28                  1 1 85 86 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_107                 1 1 86 87
Split                    splitncnn_12             1 2 87 88 89
Convolution              conv_29                  1 1 89 90 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_108                 1 1 90 91
Convolution              conv_30                  1 1 91 92 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_109                 1 1 92 93
BinaryOp                 add_6                    2 1 88 93 94 0=0
Convolution              conv_31                  1 1 84 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_110                 1 1 95 96
Concat                   cat_3                    2 1 94 96 97 0=0
Convolution              conv_32                  1 1 97 98 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_111                 1 1 98 99
Convolution              conv_33                  1 1 99 100 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_112                 1 1 100 101
Split                    splitncnn_13             1 2 101 102 103
Pooling                  maxpool2d_78             1 1 103 104 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_14             1 2 104 105 106
Pooling                  maxpool2d_79             1 1 106 107 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 107 108 109
Pooling                  maxpool2d_80             1 1 109 110 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 102 105 108 110 111 0=0
Convolution              conv_34                  1 1 111 112 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_113                 1 1 112 113
Convolution              conv_35                  1 1 113 114 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_114                 1 1 114 115
Split                    splitncnn_16             1 2 115 116 117
Interp                   upsample_150             1 1 117 118 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 118 80 119 0=0
Split                    splitncnn_17             1 2 119 120 121
Convolution              conv_36                  1 1 121 122 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_115                 1 1 122 123
Convolution              conv_37                  1 1 123 124 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_116                 1 1 124 125
Convolution              conv_38                  1 1 125 126 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_117                 1 1 126 127
Convolution              conv_39                  1 1 120 128 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_118                 1 1 128 129
Concat                   cat_6                    2 1 127 129 130 0=0
Convolution              conv_40                  1 1 130 131 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_119                 1 1 131 132
Convolution              conv_41                  1 1 132 133 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_120                 1 1 133 134
Split                    splitncnn_18             1 2 134 135 136
Interp                   upsample_151             1 1 136 137 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 137 46 138 0=0
Split                    splitncnn_19             1 2 138 139 140
Convolution              conv_42                  1 1 140 141 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_121                 1 1 141 142
Convolution              conv_43                  1 1 142 143 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_122                 1 1 143 144
Convolution              conv_44                  1 1 144 145 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_123                 1 1 145 146
Convolution              conv_45                  1 1 139 147 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_124                 1 1 147 148
Concat                   cat_8                    2 1 146 148 149 0=0
Convolution              conv_46                  1 1 149 150 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_125                 1 1 150 151
Split                    splitncnn_20             1 3 151 152 153 154
Convolution              conv_47                  1 1 154 155 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_126                 1 1 155 156
Concat                   cat_9                    2 1 156 135 157 0=0
Split                    splitncnn_21             1 2 157 158 159
Convolution              conv_48                  1 1 159 160 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_127                 1 1 160 161
Convolution              conv_49                  1 1 161 162 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_128                 1 1 162 163
Convolution              conv_50                  1 1 163 164 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_129                 1 1 164 165
Convolution              conv_51                  1 1 158 166 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_130                 1 1 166 167
Concat                   cat_10                   2 1 165 167 168 0=0
Convolution              conv_52                  1 1 168 169 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_131                 1 1 169 170
Split                    splitncnn_22             1 3 170 171 172 173
Convolution              conv_53                  1 1 173 174 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_132                 1 1 174 175
Concat                   cat_11                   2 1 175 116 176 0=0
Split                    splitncnn_23             1 2 176 177 178
Convolution              conv_54                  1 1 178 179 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_133                 1 1 179 180
Convolution              conv_55                  1 1 180 181 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_134                 1 1 181 182
Convolution              conv_56                  1 1 182 183 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_135                 1 1 183 184
Convolution              conv_57                  1 1 177 185 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_136                 1 1 185 186
Concat                   cat_12                   2 1 184 186 187 0=0
Convolution              conv_58                  1 1 187 188 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_137                 1 1 188 189
Split                    splitncnn_24             1 2 189 190 191
MemoryData               pnnx_53                  0 1 192 0=8400
Convolution              conv_59                  1 1 153 193 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_138                 1 1 193 194
Convolution              conv_60                  1 1 194 195 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_139                 1 1 195 196
Convolution              conv_61                  1 1 196 197 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_62                  1 1 152 198 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_140                 1 1 198 199
Convolution              conv_63                  1 1 199 200 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_141                 1 1 200 201
Convolution              conv_64                  1 1 201 202 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_13                   2 1 197 202 203 0=0
Convolution              conv_65                  1 1 172 204 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_142                 1 1 204 205
Convolution              conv_66                  1 1 205 206 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_143                 1 1 206 207
Convolution              conv_67                  1 1 207 208 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_68                  1 1 171 209 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_144                 1 1 209 210
Convolution              conv_69                  1 1 210 211 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_145                 1 1 211 212
Convolution              conv_70                  1 1 212 213 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_14                   2 1 208 213 214 0=0
Convolution              conv_71                  1 1 191 215 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_146                 1 1 215 216
Convolution              conv_72                  1 1 216 217 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_147                 1 1 217 218
Convolution              conv_73                  1 1 218 219 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_74                  1 1 190 220 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_148                 1 1 220 221
Convolution              conv_75                  1 1 221 222 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_149                 1 1 222 223
Convolution              conv_76                  1 1 223 224 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_15                   2 1 219 224 225 0=0
Reshape                  reshape_152              1 1 203 226 0=6400 1=65
Reshape                  reshape_153              1 1 214 227 0=1600 1=65
Reshape                  reshape_154              1 1 225 228 0=400 1=65
Concat                   cat_16                   3 1 226 227 228 229 0=1
Slice                    split_0                  1 2 229 230 231 -23300=2,64,1 1=0
Reshape                  reshape_155              1 1 230 232 0=8400 1=16 2=4
Permute                  transpose_158            1 1 232 233 0=2
Softmax                  softmax_1                1 1 233 234 0=0 1=1
Convolution              conv_77                  1 1 234 235 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_156              1 1 235 236 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 237 0=8400 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 238 0=8400 1=2
Slice                    chunk_0                  1 2 236 239 240 -23300=2,-233,-233 1=0
BinaryOp                 sub_7                    2 1 237 239 241 0=1
Split                    splitncnn_25             1 2 241 242 243
BinaryOp                 add_8                    2 1 238 240 244 0=0
Split                    splitncnn_26             1 2 244 245 246
BinaryOp                 add_9                    2 1 242 245 247 0=0
BinaryOp                 div_10                   1 1 247 248 0=3 1=1 2=2.0
BinaryOp                 sub_11                   2 1 246 243 249 0=1
Concat                   cat_17                   2 1 248 249 250 0=0
Reshape                  reshape_157              1 1 192 251 0=8400 1=1
BinaryOp                 mul_12                   2 1 250 251 252 0=2
Sigmoid                  sigmoid_0                1 1 231 253
Concat                   cat_18                   2 1 252 253 out0 0=0
